CSI API ETABS v1

# cPluginCallbackErrorFlag Property

---

Indicates whether an error occurred

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int ErrorFlag { get; }

    ReadOnly Property ErrorFlag As Integer
    	Get

    Dim instance As cPluginCallback
    Dim value As Integer

    value = instance.ErrorFlag

    property int ErrorFlag {
    	int get ();
    }

    abstract ErrorFlag : int with get

#### Return Value

Type: Int32
Zero if the plugin completed successfully; a non-zero value indicates that an
error occurred

See Also

#### Reference

cPluginCallback Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com